{
    "Appearance": [
        "Broad shoulders, tightly braided hair.",
        "Weathered skin and a perpetual scowl.",
        "Soft voice, sharp cheekbones.",
        "Lean build, missing two fingers.",
        "Piercing gaze, short-cropped hair.",
        "Slouched posture, hands always fidgeting.",
        "Streak of white in otherwise black hair.",
        "Wears a patch over one eye.",
        "Broad jaw, broken nose never set right.",
        "Long cloak, always drawn tight around them.",
        "Heavyset frame, kind eyes.",
        "Elaborate tattoos crawling up their arms.",
        "Wiry build, quick hands.",
        "Messy curls and tired eyes.",
        "Scar beneath left eye, barely noticeable.",
        "Limp in the right leg, walks with a cane.",
        "Always looks slightly damp, like caught in rain.",
        "Deep-set eyes and a thousand-yard stare.",
        "Tall and gaunt, fingers stained with ink.",
        "Crooked teeth and a welcoming grin.",
        "Hair buzzed close to the scalp, with nicks from a dull blade.",
        "Thin frame wrapped in layers of worn fabric.",
        "Burn mark across the jaw, mostly healed.",
        "Lush beard braided with copper rings.",
        "One sleeve pinned up where an arm used to be.",
        "Walks barefoot, even on cobblestone.",
        "Tattooed knuckles with faded ink.",
        "Mouth often hidden behind a scarf or mask.",
        "Left ear is missing. Always smells faintly of lavender or smoke."
    ],
    "Worships": [
        "Jaydis - God of Harmony and Balance",
        "Maya - Goddess of Day and Light",
        "Solaren - Goddess of Truth and Clarity",
        "Vivarakan - Lord of Beginning and Vitality",
        "Zithra - God of Warmth and Pleasure",
        "Apsen - Goddess of Travel and Crossroads",
        "Auroris - Deity of Nature and Weather",
        "Julevir - God of Inspiration and Creativity",
        "Jun - Deity of Dreams and Illusions",
        "Mabu - Entity of Chaos and Entropy",
        "Ocea - Goddess of the Seas and Tides",
        "Alfind - Deity of Ending and Closure",
        "Defenestria - Goddess of Frost and Pain",
        "Lolth - Lady of Trickery and War",
        "Noxtum - Lord of the Night and Shadows",
        "Sable - Lady of Silence and Reflection"
    ],
    "Quirk": [
        "Avoids stepping on cracks.",
        "Interrupts themselves often.",
        "Wears mismatched socks.",
        "Laughs nervously after sentences.",
        "Constant whispering.",
        "Quotes obscure poetry.",
        "Never finishes their jokes.",
        "Hyperbolic about everything.",
        "Mixes up left and right.",
        "Really into marionettes.",
        "Can't sleep in a room by themselves.",
        "Always yawning. Never tired.",
        "Complains but won't get into specifics.",
        "Keeps a detailed journal/diary.",
        "Dances. And is damn good at it.",
        "Believes birds are following them. Keeps score.",
        "Refuses to sit with their back to any door.",
        "Greets animals with formal titles. Sir Pigeon!",
        "Drinks tea at exactly 4:04pm. Gets very agitated if they miss it.",
        "Has memorized a different fun fact for each day of the year.",
        "Carries around a tiny book labeled “Apologies Owed.”",
        "Can no longer hear music, but pretends they can.",
        "Invents elaborate backstories for mundane objects.",
        "Always corrects people on obscure facts. Usually wrong.",
        "Laughs at things no one else finds funny.",
        "Starts every morning reciting their own daily affirmation. Loudly.",
        "Wears gloves at all times, even when eating.",
        "Winks at everyone. Nobody's sure what they think it means.",
        "Finishes other people’s sentences — but always incorrectly.",
        "Is convinced they’ve been cursed.",
        "Insists they are technically a count/countess. Of a place that no longer exists.",
        "Claps after their own clever remarks. Every time.",
        "Has imaginary conversations with someone they haven’t seen in years.",
        "Carries a broken timepiece they wind every morning anyway.",
        "Refuses to wear shoes that don’t squeak.",
        "Carves tally marks into the inside of their bracer. Never says what they count.",
        "Traces the shape of scars that aren’t there anymore.",
        "Keeps a “to-do” list that always ends with “Be better.”",
        "Introduces themselves with a different name every day. Gets annoyed if you forget it.",
        "Keeps a spoon in their boot “in case things get dire.”",
        "Says goodnight to the moon, even when indoors. Insists it’s rude not to.",
        "Winks at themselves in reflective surfaces. Sometimes mutters, “Still got it.”",
        "Makes up elaborate fake backstories for their scars. The real stories are boring. Probably.",
        "Talks in the third person when overwhelmed. “She’s fine. She’s just… recalibrating.”",
        "Carries a tiny bell they ring when they want attention. Says it’s “a personal boundary tool.”",
        "Writes letters to their future self. Leaves them in places they’ll “accidentally” find.",
        "Believes they are immortal."
    ],
    "Secret": [
        "Spy for rival kingdom.",
        "Practices forbidden magic.",
        "Has unread love letters.",
        "Noble hiding identity.",
        "Prophetic visions.",
        "Stole temple relic.",
        "On the run from their parents.",
        "Pretending to have amnesia.",
        "Once made a deal with something they don’t fully understand.",
        "Used to be part of a cult. Left. Still has dreams about it.",
        "Is technically dead, on paper.",
        "Has visions of a past life.",
        "Their familiar is their ex. Long story.",
        "Was once engaged to someone now trying to kill them.",
        "Made a wish to forget someone. It worked. They're scared to remember why.",
        "Their last relationship ended in a duel. They never talk about who won.",
        "Isn't their real name. They stole the identity of a dead traveler years ago.",
        "Made a deal to save their sibling’s life. The cost? Someone else’s.",
        "Has no childhood memories before age 10. And there are strange gaps after that too.",
        "Their dreams aren’t theirs. They’ve been seeing things no one else should know.",
        "Carries a sealed letter they’re too afraid to open. It’s in their own handwriting.",
        "Once helped kill a god. It wasn’t on purpose. They don’t know if it stayed dead.",
        "Knows the location of a sealed vault that should never, ever be opened. They’re tempted anyway.",
        "Can see how people die when they touch them. Hasn’t told a soul.",
        "They’re hiding someone. Literally. In their bag. It’s complicated.",
        "Is heavily in debt to a dangerous criminal organization.",
        "Secretly collects incredibly dangerous and illegal artifacts.",
        "Knows the location of a hidden portal to another plane but tells no one.",
        "Sold their voice/memories/luck in a desperate bargain they now regret.",
        "Is the sole survivor of a magical experiment that went horribly wrong.",
        "Faked their own credentials; isn't actually qualified for their profession.",
        "Isn't aging normally (either too fast or too slow) for an unknown reason."
    ],
    "Goal": [
        "Find lost sibling.",
        "Become renowned artisan.",
        "Cure rare illness.",
        "Seek ancient magic.",
        "Redeem past mistakes.",
        "Broker peace between clans.",
        "Clear their family name... even if the family was guilty.",
        "Keep everyone alive this time. Just this once.",
        "Find their child. Or at least what happened to them.",
        "Die in a way that means something.",
        "Be remembered… but not for that.",
        "Befriend a dragon.",
        "Learn every language.",
        "Reclaim the scarf they lent to an ex three years ago.",
        "Win a duel over a perceived insult they can't quite remember.",
        "Ensure their name is whispered with equal parts awe and fear.",
        "Become someone’s tragic backstory.",
        "Force their former mentor to admit they were wrong. Publicly. Loudly.",
        "Fake their own death. For the drama.",
        "Outlive everyone who ever doubted them. Especially that Elf.",
        "Get official recognition for a crime they were falsely accused of... because it was brilliant, and they wish they had done it.",
        "Convince the gods that they deserve an epic prophecy too, damn it.",
        "Own a sword with a name. A sick name.",
        "Get someone to write a song about them. Ideally a banger.",
        "Return a powerful relic they stole as a prank.",
        "Convince their hometown they’re not a villain. Or lean in. Still deciding.",
        "Track down the bard who keeps spreading inaccurate stories about them. Demand edits.",
        "Get justice for their village.",
        "Win back their ex’s dog. The breakup was mutual. The custody battle wasn’t.",
        "Impress a certain someone at the tavern.",
        "Replace the current king.",
        "Make their past selves proud. Or at least a little less ashamed."
    ],
    "Fear": [
        "Being forgotten.",
        "Disappointing their deity.",
        "Past being revealed.",
        "Open waters.",
        "Unknown magic.",
        "Emotional vulnerability.",
        "Pain. Just any pain. Zero pain tolerance.",
        "That people only pretend to like them.",
        "Heights that... really aren't that high.",
        "The dark.",
        "Cats. (They have recurring nightmares of cats.)",
        "Being poisoned.",
        "Betrayal. Sees a snake in everyone.",
        "Being touched. Even kindly.",
        "Silence.",
        "Being handed responsibility. Even if it’s small.",
        "Public speaking. Even if it's just ordering food.",
        "Horses. 'They just know things.'",
        "Sudden loud sounds; even happy ones, like applause.",
        "Their own anger.",
        "Long silences in conversation.",
        "Caves. Particularly ones that breathe.",
        "Sudden, overwhelming joy. (They don’t trust it.)",
        "Doors that are slightly ajar. Never trust them.",
        "Bugs.",
        "Porcelain dolls. Especially if they weren’t there five minutes ago.",
        "Getting what they want… and it not making anything better.",
        "Fireworks. Not because of the sound, because of the anticipation.",
        "Being the only one who can hear the voice.",
        "Whispers from a familiar voice that you know has died.",
        "Claustrophobic.",
        "Their own potential for cruelty.",
        "Mind-altering magic.",
        "Being the center of attention, even for positive reasons.",
        "That they are secretly dreaming and might wake up somewhere else entirely.",
        "Deep forests at night. It's not the dark, it's the trees).",
        "Growing old.",
        "Failure, specifically in front of people they respect.",
        "That hope is a trap. Refuses to get optimistic about anything."
    ],
    "Profession": [
        "Traveling herbalist.",
        "Arcane blacksmith.",
        "Historical records keeper.",
        "Merchant of magical fabrics.",
        "Beastmaster.",
        "Scholar of manic field.",
        "Retired assassin.",
        "Therapist.",
        "Potion sommelier.",
        "Herbal apothecary.",
        "Trinket vendor.",
        "Scribe-for-hire.",
        "Census agent.",
        "Cartographer-in-training.",
        "Fortune reader",
        "Personal guard for a retired noble who keeps running away.",
        "Traveling hat tailor.",
        "Dream chronicler.",
        "Conflict de-escalator.",
        "Retired adventurer turned tavern food critic.",
        "Summoning circle inspector.",
        "Cobbler.",
        "Weather vane artisan.",
        "Animal translator. Wrong, but very confident.",
        "Self-declared hero biographer.",
        "Local legend. Nobody quite remembers why.",
        "Inter-planar dating coach.",
        "Doomsday preparer. No known dooms scheduled.",
        "Apology letter writer.",
        "Local brewer.",
        "Gravedigger.",
        "Shepherd.",
        "Veterinarian for familiars.",
        "Private investigator.",
        "Town crier.",
        "Tax collector.",
        "Tattoo artist.",
        "Street performer.",
        "Wilderness guide.",
        "Exotic pet dealer.",
        "Rat catcher.",
        "Unemployed.",
        "Tinkerer/inventor."
    ],
    "Ally": [
        "Talkative imp companion.",
        "Mysterious Elven archivist.",
        "Exiled knight seeking redemption.",
        "Wise elderly druid.",
        "Unreliable bard.",
        "Shy warforged with lost memories.",
        "Disgraced noble now posing as a mercenary.",
        "A Tabaxi thief who insists they’re retired.",
        "Reformed cultist with very strong opinions.",
        "Elderly Orc philosopher who gives unsolicited life advice.",
        "A sentient sword that won't stop narrating your life.",
        "A Halfling playwright obsessed with writing your biography.",
        "Former pirate captain turned tea shop owner.",
        "A ghost that only appears to them... and heckles them constantly.",
        "Tabaxi gambler who’s very bad at gambling.",
        "An Aarakocra with a broken wing and a heart full of schemes.",
        "Old flame who’s clearly not over them.",
        "Ex-bandmate from a short-lived traveling bard troupe.",
        "Pen pal they’ve never met in person but fully trust.",
        "A sibling thought to be lost, now reappeared with secrets.",
        "An ex who’s totally chill now, except when they’re not.",
        "Tortle bard with 300 stories and no filter.",
        "A con artist pretending to be their cousin. They know, but it's funny.",
        "Halfling alchemist who stores unstable potions in their backpack.",
        "Cleric who’s sure they’re fated to die saving them."
    ]
}